The main objective was always the analysis of Telemetry. The best and most accurate option to study this component would have been to analyze it source code. Unluckily this isn't possible as the Windows kernel is not open source. However, it was still possible to reverse engineer the Windows kernel to understand how Telemetry works. 
Several files (dynamic libraries, executables, drivers) had to be reversed and analyzed. Nonetheless, there was one file that had the main focus: {\bfseries ntoskrnl.exe}. This binary held the actual implementation of the Windows Kernel.

Following sections will depict different challenges and achievements faced during the analysis of this and the other binaries.



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Understanding how Telemetry makes use of ETW %%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\section{Understanding how Telemetry makes use of ETW}\label{understanding_telemetry_etw}

When Windows OS boots, multiple sessions are created inside ETW. Among them there is one related to Telemetry: DiagTrack. As explained in \ref{ETW}, every session has "providers" -those entities that actually provide information to the session-. In order to understand how Telemetry made use of ETW, it was important to learn about DiagTrack's session providers. At this point, the answers for the following questions were unknown:
\begin{enumerate}
\setlength\itemsep{0.05em}
\item Who are they?
\item Where are they?

    \includegraphics[width=15cm]{images/write_functions.png}
    \caption[]{Group of ETW Write functions.}
    \label{fig:etw_write_group_functions}
  \end{figure}
\end{centering}

As can be appreciated in figure \ref{fig:etw_write_group_functions} all functions end up calling either {\bfseries nt!EtwpEventWriteFull}, {\bfseries nt!EtwpWriteUserEvent} or {\bfseries nt!WdispStartEndScenario}. After extensive analysis logging all actions and functions that were executed, it was possible to conclude that the function {\bfseries nt!WdispStartEndScenario} was never called under the context of interest of this research. This meant, that the analysis of the writing phase could be carried out focusing only in the first two functions: {\bfseries nt!EtwpEventWriteFull} and {\bfseries nt!EtwpWriteUserEvent}.

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%  Ensuring providers write to DiagTrack session
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\subsection{\bfseries{Ensuring providers write to DiagTrack session}}
The previous idea of only analyzing writes from providers that were returned by the powershell command had, at least, three problems:

\begin{enumerate}
\setlength\itemsep{0.05em}
  \item The output of the powershell command returned providers that were registered in a particular session at a given time $t$. If a provider registers, writes and unregisters itself from the session in a time frame $tf$ where $t \not\in tf$, that write won't be took into consideration.
  \item Even if the provider is registered against DiagTrack's session, this doesn't ensure the provider is currently writing to it.
  \item It relied too much on manual analysis.
\end{enumerate}

With these problems in mind new ideas began to appear. In particular there was one that made the difference: What if it's possible to relate the handler that it's used at the moment of writing, with the session where the provider going to write. If that's possible, the first two problems would be solved. The third one could be solved as only one breakpoint at the writing function will be enough to make the full analysis. 

Following sections will detail the process to find an answer to these problems.


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%  Inspecting ETW structures
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\subsubsection{\bfseries Inspecting ETW structures}
So far it happened a lot that ETW structures were the key to overcome different obstacles. We wanted to know if this was again the case. 

The first structure analyzed was $\_ETW\_REG\_ENTRY$ (figure \ref{fig:regentrylayout}) as it would have been the most direct and easier way to relate session and provider. Unfortunately, none of its components were helpful.

The next structure analyzed was $\_WMI\_LOGGER\_CONTEXT$. This structure seemed to be the actual representation of an ETW session. Due to its size, only  necessary and representative offsets are depicted: 

\begin{figure}[H]
  \begin{lstlisting}
   +0x000 LoggerId         : Uint4B
   +0x004 BufferSize       : Uint4B
   +0x008 MaximumEventSize : Uint4B
   +0x00c LoggerMode       : Uint4B
   +0x010 AcceptNewEvents  : Int4B
   [...]
   +0x070 ProviderBinaryList : _LIST_ENTRY
   +0x080 BatchedBufferList : Ptr64 _WMI_BUFFER_HEADER
   +0x080 CurrentBuffer    : _EX_FAST_REF
   +0x088 LoggerName       : _UNICODE_STRING
   +0x098 LogFileName      : _UNICODE_STRING
   +0x0a8 LogFilePattern   : _UNICODE_STRING
   +0x0b8 NewLogFileName   : _UNICODE_STRING
   [...]
   +0x428 LastBufferSwitchTime : _LARGE_INTEGER
   +0x430 BufferWriteDuration : _LARGE_INTEGER
   +0x438 BufferCompressDuration : _LARGE_INTEGER
  \end{lstlisting} 
  \caption[]{$\_WMI\_LOGGER\_CONTEXT$ structure.}
  \label{fig:wmi_logger_context}
\end{figure}

Each ETW session will have an instance of this structure. At offset $0x70$ there is an attribute called {\bfseries ProviderBinaryList}. After a quick analysis this attribute seemed to held all providers registered against the session in the format of a double linked list. In order to confirm that theory, the process of attaching new providers to an existing session was analyzed. 

The function $nt!EtwpAddProviderToSession$ seemed to be the one creating these links. During the analysis several problems were faced: lot of unknown new functions, hard to reverse, no documentation at all, among others. Besides all mentioned issues, there was a key reason that made the previous analysis to be called off: the structure $\_TRACE\_ENABLE\_INFO$.




%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%  GUID and Group GUID
